{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "\u2600\ufe0f",
    "1": "\u263a\ufe0f",
    "2": "\u2705",
    "3": "\u2714\ufe0f",
    "4": "\u2728",
    "5": "\u2764\ufe0f",
    "6": "\ud83c\udf73",
    "7": "\ud83c\udf89",
    "8": "\ud83d\udc07",
    "9": "\ud83d\udc23",
    "10": "\ud83d\udc30",
    "11": "\ud83d\udc40",
    "12": "\ud83d\udc49",
    "13": "\ud83d\udc4d",
    "14": "\ud83d\udc7b",
    "15": "\ud83d\udc80",
    "16": "\ud83d\udca9",
    "17": "\ud83d\udd25",
    "18": "\ud83d\udd95",
    "19": "\ud83d\ude02",
    "20": "\ud83d\ude05",
    "21": "\ud83d\ude07",
    "22": "\ud83d\ude09",
    "23": "\ud83d\ude0b",
    "24": "\ud83d\ude0d",
    "25": "\ud83d\ude0e",
    "26": "\ud83d\ude21",
    "27": "\ud83d\ude24",
    "28": "\ud83d\ude28",
    "29": "\ud83d\ude2d",
    "30": "\ud83d\ude4f",
    "31": "\ud83e\udd0d",
    "32": "\ud83e\udd14",
    "33": "\ud83e\udd21",
    "34": "\ud83e\udd23",
    "35": "\ud83e\udd5a",
    "36": "\ud83e\udd70",
    "37": "\ud83e\udd72",
    "38": "\ud83e\udd73",
    "39": "\ud83e\udd75",
    "40": "\ud83e\udd79",
    "41": "\ud83e\udee0",
    "42": "\ud83e\udee1"
  },
  "initializer_range": 0.02,
  "label2id": {
    "\u2600\ufe0f": 0,
    "\u263a\ufe0f": 1,
    "\u2705": 2,
    "\u2714\ufe0f": 3,
    "\u2728": 4,
    "\u2764\ufe0f": 5,
    "\ud83c\udf73": 6,
    "\ud83c\udf89": 7,
    "\ud83d\udc07": 8,
    "\ud83d\udc23": 9,
    "\ud83d\udc30": 10,
    "\ud83d\udc40": 11,
    "\ud83d\udc49": 12,
    "\ud83d\udc4d": 13,
    "\ud83d\udc7b": 14,
    "\ud83d\udc80": 15,
    "\ud83d\udca9": 16,
    "\ud83d\udd25": 17,
    "\ud83d\udd95": 18,
    "\ud83d\ude02": 19,
    "\ud83d\ude05": 20,
    "\ud83d\ude07": 21,
    "\ud83d\ude09": 22,
    "\ud83d\ude0b": 23,
    "\ud83d\ude0d": 24,
    "\ud83d\ude0e": 25,
    "\ud83d\ude21": 26,
    "\ud83d\ude24": 27,
    "\ud83d\ude28": 28,
    "\ud83d\ude2d": 29,
    "\ud83d\ude4f": 30,
    "\ud83e\udd0d": 31,
    "\ud83e\udd14": 32,
    "\ud83e\udd21": 33,
    "\ud83e\udd23": 34,
    "\ud83e\udd5a": 35,
    "\ud83e\udd70": 36,
    "\ud83e\udd72": 37,
    "\ud83e\udd73": 38,
    "\ud83e\udd75": 39,
    "\ud83e\udd79": 40,
    "\ud83e\udee0": 41,
    "\ud83e\udee1": 42
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "vocab_size": 30522
}
